app/controllers/account_activations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nhathuy.155@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated", 1], ["updated_at", "2021-02-01 03:27:01.893294"], ["id", 8]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2021-02-01 03:27:01.995564"], ["activated_at", "2021-02-01 03:27:01.994759"], ["id", 8]]
---
  def edit
    user = User.find_by email: params[:email]
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute :activated, true
      user.update_attribute :activated_at, Time.zone.now