app/controllers/sessions_controller.rb

  def load_user
    @user = User.find_by email: params[:session][:email].downcase
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "huy@gmail.com"], ["LIMIT", 1]]