app/controllers/users_controller.rb

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]