app/controllers/users_controller.rb

  def update
    @user = User.find_by(id: params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "huy@gmail.com"], ["password_digest", "$2a$10$4iZ7D3gdblI/izLvMMGzxueh9XnxeA9aPg6bQvpjI067MIr/NBMu."], ["updated_at", "2021-01-29 02:51:15.300177"], ["id", 1]]

  def index
    # @users = User.all
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def destroy
    User.find_by(id: params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def correct_user
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]